{
    "24": {
        "title": "Geographical search (centre on coordinates)",
        "text": "If coordinates of a point of interest are known, these can simply be entered in the “Search location, zip, coordinate” field, to centre the map on the required point: for example \"600000 200000\" in national coordinates or \"46.5 6.0\" for latitiude and longitude",
        "image": ""
    },
    "25": {
        "title": "Geographical search (place name or postcode)",
        "text": "The “Search location, zip, coordinate” field enables direct access to any place or commune name, any Swiss postcode or indeed any location named on the national map at any scale (mountain, valley, pass, hamlet, farmhouse, hut, river, stream, lake, etc.) As soon as a letter or number is entered, suggestions for place names or postcodes respectively will start to appear; if the desired name or postcode becomes visible it is then sufficient to click on it.",
        "image": ""
    },
    "28": {
        "title": "2.5D / (3D ALPHA)",
        "text": "The viewer can also be activated in 2.5D / 3D mode. You can put all 2D data on the terrain model - with probable distortions for some areas. To enable this feature, the 2.5D button must be activated. Data can be added via the search or the catalog.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eIMPORTANT\u003c/b\u003e: This feature is available in an alpha version, as an early stage of development. The availability of version alpha can not be guaranteed - they can be deactivated under certain circumstances.\u003cbr\u003e\u003cbr\u003e\n\n\n\u003cimg src=\"http://help.geo.admin.ch/img/28_e.png\"\u003e\u003cbr\u003e\u003cbr\u003e\n\n\u003cb\u003eTilt up/down\u003c/b\u003e\u003cbr\u003e\nPC + Mac: Shift or CTRL or ALT + left mouse button + drag up / down\u003cbr\u003e\nTouch:\n\u003cimg style=\"border:none !important;\" src=\"http://help.geo.admin.ch/img/TouchTilt.png\"\u003e\u003cbr\u003e\n\u003ci\u003eTilts the viewer toward \"horizon\" / \"top-down\" view.\u003c/i\u003e\u003cbr\u003e\u003cbr\u003e\n\n\u003cb\u003eLook\u003c/b\u003e\u003cbr\u003e\nPC: CTRL + left mouse button + drag\t\u003cbr\u003e\nMac: Command/Open Apple Key + mouse button + drag\u003cbr\u003e\nTouch:\n\u003cimg style=\"border:none !important;\"  src=\"http://help.geo.admin.ch/img/TouchRotate.png\"\u003e\u003cbr\u003e\n\u003ci\u003ePerspective points in another direction, as if you are turning your head up, down, left or right.\u003c/i\u003e\u003cbr\u003e\u003cbr\u003e\n\n\u003cb\u003eZoom in/Zoom out\u003c/b\u003e\u003cbr\u003e\nPC + Mac: Scroll wheel or right mouse + drag up / down\u003cbr\u003e\nTouch:\n\u003cimg style=\"border:none !important;\"  src=\"http://help.geo.admin.ch/img/TouchZoom.png\"\u003e\u003cbr\u003e\n\u003ci\u003eZooms the viewer in and out.\u003c/i\u003e\u003cbr\u003e\u003cbr\u003e\n\n\u003cb\u003eMove left / right\u003c/b\u003e\u003cbr\u003e\nPC + Mac: Left / right arrow \u003cbr\u003e\nTouch: One finger drag left / right\u003cbr\u003e\u003cbr\u003e\n\n\u003cb\u003eMove forward / backward \u003c/b\u003e\u003cbr\u003e\nPC + Mac: Up / down arrow \u003cbr\u003e\nTouch: One finger drag forward / backward\u003cbr\u003e\u003cbr\u003e",
        "image": ""
    },
    "31": {
        "title": "Full text search for data",
        "text": "Under \"Search\" you can enter search terms (keywords such as marsh, road, commune, earthquake) in order to search through all centrally available digital geodata. When you select one of the results offered, it will be displayed on the map viewer, as a separate data layer",
        "image": ""
    },
    "32": {
        "title": "Search for data (catalogue)",
        "text": "Under \"Change topic\" you will find all available digital data classified by theme. When you select a data-set (by clicking on the circle symbol to the right) it will be displayed directly by the map viewer, as a separate layer of data.",
        "image": ""
    },
    "34": {
        "title": "Change the visibility of the selected dataset",
        "text": "Click the Icon (1). The transparency/opacity of each selected data-set (layer) can be individually adjusted by activating the layer options and the changing the horizontal slider. Options menu can then be hidden again if required.",
        "image": ""
    },
    "35": {
        "title": "Change the order of the selected datasets",
        "text": "Click the Icon (1). The order of the selected data-sets (layers) can be changed by using the up or down arrows (2) in the “selection” pane.",
        "image": ""
    },
    "36": {
        "title": "Remove selected datasets",
        "text": "A selected data-set (layer) can be removed from the “Selection” list and from the map itself by using the “Remove layer” (Close) button (1).",
        "image": ""
    },
    "37": {
        "title": "View additional information about a data-set",
        "text": "In the “Selection”, “Search” or “Catalogue” pane, the “i” button provides access to an information window about the selected data-set (layer). The information provided covers; the range of applicable scales, available metadata, a link to the description of the data, how to order data, the relevant thematic geoportal and WMS service and the issue date (latest revision date) of the data.",
        "image": ""
    },
    "39": {
        "title": "Datenbezug",
        "text": "Die Daten, die im Kartenfenster angezeigt werden, können, falls vom entsprechenden BA vorgesehen direkt bei deisem bezogen werden. Über den info Knopf wird das Info Fenster zu einem ausgewähltem Datensatz geöffnet. Der Link Datenbezug führt zur jeweiligen Bezugsstelle.",
        "image": ""
    },
    "44": {
        "title": "How to select objects « Query Tool »",
        "text": "\u003col type=\"1\"\u003e\u003cli\u003eChoose a dataset from the topic « Aviation » (e.g. Air navigation obstacles). All datasets whose attributes are searchable, can be used in this tool. \u003ca href=\"//api3.geo.admin.ch/api/faq/index.html#which-layers-are-searchable\" target=\"_blank\"\u003eHere’s an overview of those datasets\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003eChoose « Object information » from the « Tools » section\u003c/li\u003e\n\u003cli\u003eTo select all objects (200 as a maximum!) inside a map perimeter, use CTRL (cmd on Mac) and draw a rectangle on the map\u003c/li\u003e\u003cbr /\u003e\u003cimg src=\"//help.geo.admin.ch/img/44a_e.jpg\"\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003e\u003cu\u003eSelect objects by attributes with types date or numeric\u003c/u\u003e\u003c/b\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cli\u003eObjects can be searched by predefined or user defined \u003cb\u003equeries\u003c/b\u003e\u003c/li\u003e\n\u003cli\u003eSet the query parameters by choosing a dataset,\u003c/li\u003e\n\u003cli\u003ean \u003cb\u003eattribute\u003c/b\u003e, an \u003cb\u003eoperator\u003c/b\u003e,\u003c/li\u003e\n\u003cli\u003eand by entering a \u003cb\u003evalue\u003c/b\u003e (numeric or date).\u003c/li\u003e\n\u003cli\u003eSeveral queries can be combined with an AND operation.\u003c/li\u003e\u003cbr /\u003eFinish your query by clicking « Search ». The objects corresponding to the query are highlighted in the map and appear inside the result list. A maximum of 200 objects can be selected.\u003cbr /\u003e\u003cbr /\u003e\u003cimg src=\"//help.geo.admin.ch/img/44b_e.jpg\"\u003e\u003cbr /\u003e\u003cbr /\u003e\u003cb\u003e\u003cu\u003eSelect objects by attributes with type domain\u003c/u\u003e\u003c/b\u003e\u003cbr /\u003eIt is possible to search by attributes with domain values (e.g. the status of Air navigation obstacles).\u003cbr /\u003e\u003cbr /\u003e\u003cli\u003eChoose the attribute « Status » from the dropdown menu\u003c/li\u003e\n\u003cli\u003eClick here in order to display all \u003cb\u003eoccurring values\u003c/b\u003e of the attribute\u003c/li\u003e\n\u003cli\u003eChoose operator  « ilike » =  or « not ilike » !=\u003c/li\u003e\u003c/ol\u003eFinish your query by clicking « Search ». The objects corresponding to the query are highlighted in the map and appear inside the result list. A maximum of 200 objects can be selected.",
        "image": ""
    },
    "62": {
        "title": "WMS import",
        "text": "Only WMS services compliant with \"Swiss Projection EPSG 21781\" and following the \u003ca href=\"http://www.opengeospatial.org/standards/wms\"\u003e WMS OGC Standard\u003c/a\u003e  can be displayed. An easy tool to check this is provided by \u003ca href =\"//www.geo.admin.ch/internet/geoportal/en/home/services/geoservices/ech0056.html\"\u003eLink\u003c/a\u003e\nGenerally the WMS datasets are visible in a given scale, that's why the right portion of the map has to be selected and appropriate scale too.\nThe displaying speed of WMS datasets and their availability is under responsibility of the service owner.\nThe WMS datasets can be saved as PDF through the \"Print\" function.\nA WMS dataset can be forwarded by email with Permalink \"Link\" function.\nPlease, follow the use conditions of the WMS service provider.",
        "image": ""
    },
    "63": {
        "title": "KML import",
        "text": "\u003cp\u003eIt is now possible to display KML saved online (by using URL) or locally (this fonction is not possible with IE)\u003c/p\u003e\u003cp\u003eOnly KML files without any error can be displayed. These files must be compliant with \u003ca href=\"http://opengeospatial.org/standards/kml\"\u003e\u003cb\u003ethe OGC KML format\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e\u003cp\u003eAn easy way to check your file is provided by \u003ca href=\"http://kmlvalidator.com/home.htm\"\u003e\u003cb\u003eLink\u003c/b\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cimg src=\"//help.geo.admin.ch/img/64d.jpg\"\u003e\u003cbr /\u003e\u003cbr /\u003e\u003ch2\u003eGenerating KML file and using it online\u003c/h2\u003e\u003cp\u003e\u003cb\u003eHow to create a .kml file\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"http://www.swisstopo.admin.ch/internet/swisstopo/de/home/apps/calc/kml.html\"\u003eOnline KML Generator\u003c/a\u003e\u003cbr\u003e\n\u003ca href=\"//help.geo.admin.ch/?id=66&lang=en\"\u003eDrawing\u003c/a\u003e\u003c/p\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003eHow to publish a .kml file online\u003c/b\u003e\u003cbr /\u003eIn order to distribute your own KML-files via a stable URL without setting up an own web server you can use the following free services for hosting and distributing:\u003c/p\u003e\u003cp\u003e\u003cb\u003e1. \u003cu\u003ePublish with Google Docs\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cul\u003e\u003cli\u003eCreate your account: \u003ca href=\"https://docs.google.com\"\u003ehttps://docs.google.com\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eUpload the file: click on the Upload button \u003e Files… \u003c/li\u003e\u003c/ul\u003e\n\u003cimg src=\"//help.geo.admin.ch/img/upload.jpg\"\u003e\n\u003cul\u003e\u003cli\u003eIn the window \"File Upload\" select your KML file and \"Open\"\u003c/li\u003e \n\u003cli\u003eIn the window \"Upload settings \"Uncheck \"Convert documents, presentations, spreadsheets, and drawings to the corresponding Google Docs format\" and \"Convert text from PDF and image files to Google documents\" and click \"Start upload\"\u003c/li\u003e \n\u003cli\u003eSelect the document by clicking in the checkbox on the left and click on the share button and then on \"Change…\" in the \"Sharing settings\" widows. Select \"Public on the web\" or \"Anyone with the link\" and click \"Save\", copy the \"Link to share\" then \"Done\".\u003c/li\u003e \u003c/ul\u003e\n\u003cimg src=\"//help.geo.admin.ch/img/sharing.jpg\"\u003e\u003cul\u003e\u003cli\u003eModify the copied Link by changing the word \"leaf\" by \"uc\" between \"https://docs.google.com/\" and \"?id=…\", the link can be use in the \"KML import\" in map.geo.admin.ch\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eExample:\u003cbr /\u003e \n\u003ca href=\"//map.geo.admin.ch/?Y=600769&X=198300.5&zoom=7&bgOpacity=0&bgLayer=ch.swisstopo.pixelkarte-grau&layers=KML%7C%7Chttps%3A%2F%2Fdocs.google.com%2Fuc%3Fid%3D0B4uRuJ1hajZmZjJlZDNiMGItNmU0Zi00N2FlLWJiZDItM2UwZDA3YmQwYzk3%26hl%3Dfr&layers_opacity=1&layers_visibility=true\"\u003e//map.geo.admin.ch/?Y=600769&X=198300.5&zoom=7&bgOpacity=0&bgLayer=ch.swisstopo.pixelkarte-grau&layers=KML%7C%7Chttps%3A%2F%2Fdocs.google.com%2Fuc%3Fid%3D0B4uRuJ1hajZmZjJlZDNiMGItNmU0Zi00N2FlLWJiZDItM2UwZDA3YmQwYzk3%26hl%3Dfr&layers_opacity=1&layers_visibility=true\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e2. \u003cu\u003ePublish with Dropbox\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\n\u003cul\u003e\u003cli\u003eCreate your account: \u003ca href=\"http://www.dropbox.com\"\u003ehttp://www.dropbox.com\u003c/a\u003e (You can install it or only use the web interface on this website)\u003c/li\u003e \n\u003cli\u003eMove your KML File in the public folder once the file is in your Public folder, simply right-click it once to open a menu. Choose \"Dropbox \u003e Copy public link\" (Dropbox installed on your computer) or \"Copy public link\" (Web interface).(More information about Shared document in Dropbox: \u003ca href=\"http://www.dropbox.com/help/16\"\u003ehttp://www.dropbox.com/help/16\u003c/a\u003e\u003cbr\u003e\n\u003cli\u003eModify the copied Link by adding  \"dl=1\": http://dl.dropbox.com/u/44486020/swisstopo.kml?\u003cb\u003edl=1\u003c/b\u003e.\u003c/li\u003e\n\u003cli\u003eThe link can be used in the \"KML import\" in map.geo.admin.ch\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eExample:\u003cbr /\u003e\u003ca href=\"//map.geo.admin.ch/?Y=600769&X=198300.5&zoom=7&bgOpacity=0&bgLayer=ch.swisstopo.pixelkarte-grau&layers=KML%7C%7Chttp%3A%2F%2Fdl.dropbox.com%2Fu%2F44486020%2Fswisstopo.kml&layers_opacity=1&layers_visibility=true\"\u003e//map.geo.admin.ch/?Y=600769&X=198300.5&zoom=7&bgOpacity=0&bgLayer=ch.swisstopo.pixelkarte-grau&layers=KML%7C%7Chttp%3A%2F%2Fdl.dropbox.com%2Fu%2F44486020%2Fswisstopo.kml&layers_opacity=1&layers_visibility=true\u003c/a\u003e\u003c/p\u003e\u003cp\u003e\u003cb\u003e3. \u003cu\u003ePublish with Gist\u003c/u\u003e\u003c/b\u003e\u003c/p\u003e\u003cp\u003e\u003ca href=\"https://gist.github.com/\"\u003eGist\u003c/a\u003e, a feature made available by \u003ca href=\"https://github.com\"\u003eGithub\u003c/a\u003e\u003c/p\u003e\u003cul\u003e\u003cli\u003eDrag your KML-file into the text field of Gist (1). After that, the code of the KML-file is visible in the text field\u003c/li\u003e\n\u003cli\u003ePush “Create Public Gist” (2)\u003c/li\u003e\n\u003cli\u003ePush “Raw” (3)\u003c/li\u003e\n\u003cli\u003eAs visible in (4), an URL with your KML-file has been generated\u003c/li\u003e\n\u003cli\u003eAccording to (5) you can now embed the KML-file via the URL in the map viewer. In addition you can create map.geo.admin.ch-permalinks with your KML and share your data with other users or on your own web page.\u003c/li\u003e\u003c/ul\u003e  \n\u003cimg src=\"//help.geo.admin.ch/img/64all.jpg\"\u003e",
        "image": ""
    },
    "66": {
        "title": "All \"draw/measure\" functions",
        "text": "1- \u003ca href=\"//help.geo.admin.ch/?id=91&lang=en\" target=\"_self\"\u003eAdd \u003cb\u003esymbol\u003c/b\u003e\u003c/a\u003e\u003cbr\u003e\n2- \u003ca href=\"//help.geo.admin.ch/?id=92&lang=en\" target=\"_self\"\u003eAdd \u003cb\u003etext\u003c/b\u003e\u003c/a\u003e\u003cbr\u003e\n3- \u003ca href=\"//help.geo.admin.ch/?id=93&lang=en\" target=\"_self\"\u003eAdd \u003cb\u003eline / polygon\u003c/b\u003e\u003c/a\u003e\u003cbr\u003e\n4- \u003ca href=\"//help.geo.admin.ch/?id=94&lang=en\" target=\"_self\"\u003e\u003cb\u003eMeasure\u003c/b\u003e\u003c/a\u003e\u003cbr\u003e\n5- \u003ca href=\"//help.geo.admin.ch/?id=95&lang=en\" target=\"_self\"\u003e\u003cb\u003eShare\u003c/b\u003e drawing / KML\u003c/a\u003e",
        "image": ""
    },
    "68": {
        "title": "Object information",
        "text": "To get informations on several obects, trace a recangle with CTRL+ mouse click, all objects included in the rectangle will be collected in a single information window:",
        "image": ""
    },
    "70": {
        "title": "Report problem",
        "text": "\u003cp\u003eThis tool enables you to send suggestions on map.geo.admin.ch. We welcome problem reports as well as general comments.\u003cbr /\u003eOpen map.geo.admin.ch and zoom in an area of interest: a street, an address, a place. Use the search tool to directly search your area of interest. Click top-right on \"Report problem\".\u003c/p\u003e\u003cp\u003e\u003cb\u003eYour e-mail\u003c/b\u003e\u003cbr /\u003eFill in the field with your e-mail address. The field is not mandatory.\u003c/p\u003e\u003cp\u003e\u003cb\u003eYour feedback to the current map extent \u003c/b\u003e\u003cbr /\u003eFill in with your comments or problem report.\u003c/p\u003e\n\u003cimg src=\"//help.geo.admin.ch/img/70e.jpg\"\u003e\u003cp\u003e\u003cb\u003eYour drawing\u003c/b\u003e\u003cbr /\u003eYou can additionally provide a drawing by using the drawing tools. The drawing will be automatically attached to the report. This section is not mandatory.\u003c/p\u003e\u003cp\u003e\u003cb\u003eAttach a file\u003c/b\u003e\u003cbr /\u003eYou can provide additional information by attaching a file (\"Browse\"). This section is not mandatory.\u003c/p\u003e\u003cp\u003eClick \"Send\"\u003c/p\u003e\u003cp\u003e\u003cb\u003eWhat file formats can be attached?\u003c/b\u003e\u003cbr /\u003eThe following formats are supported: .pdf, .zip, .jpg, .jpeg, .kml, .kmz oder gpx.\u003c/p\u003e\u003cp\u003e\u003cb\u003eWhat happens to my report?\u003c/b\u003e\u003cbr /\u003eIn case of problems related to data, the information will be forwarded to the respective data owner.\u003c/p\u003e",
        "image": ""
    }
}